# PhyMaterialParamExpCoeff1 Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..PhyMaterialParamExpCoeff1 Property
ParameterTypeId Class See Also
---
"Thermal expansion coefficient X"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId PhyMaterialParamExpCoeff1 { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PhyMaterialParamExpCoeff1 As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PhyMaterialParamExpCoeff1 {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace